adwaita-icon-theme
aircrack-ng
ansible
baobab
bash
bash-completion
bdw-gc
brew-cask-completion
brotli
ca-certificates
cabextract
cairo
capstone
cffi
curl
docker-compose
dockutil
dtc
fontconfig
freerdp
freetype
fribidi
gawk
gdbm
gdk-pixbuf
gettext
git
git-secret
glib
gmp
gnupg
gnutls
graphene
graphite2
gtk4
guile
harfbuzz
hicolor-icon-theme
htop
icu4c
jpeg-turbo
libadwaita
libassuan
libepoxy
libevent
libgcrypt
libgpg-error
libidn2
libksba
liblinear
libnghttp2
libpng
libpthread-stubs
librsvg
libslirp
libssh
libssh2
libtasn1
libtiff
libtool
libunistring
libusb
libx11
libxau
libxcb
libxcursor
libxdmcp
libxext
libxfixes
libxi
libxinerama
libxrandr
libxrender
libxv
libyaml
lua@5.3
lz4
lzo
m4
mackup
mas
micro
mono
mpdecimal
mpfr
ncurses
neofetch
nettle
nmap
npth
openldap
openssl@1.1
openssl@3
p11-kit
p7zip
pango
pcre
pcre2
pinentry
pixman
pkg-config
podman
putty
pycparser
python-certifi
python-cryptography
python-docopt
python-lxml
python-markupsafe
python-packaging
python-pytz
python-setuptools
python@3.10
python@3.12
pyyaml
qemu
rclone
readline
rtmpdump
screenresolution
six
snappy
sqlite
tmux
unbound
unzip
utf8proc
vde
wget
winetricks
xorgproto
xz
zstd
adobe-acrobat-reader
alacritty
alfred
atom
audacity
cyberduck
darktable
google-chrome
hammerspoon
iterm2
keepassxc
librecad
macfuse
meld
playonmac
powershell
rancher
rectangle
smcfancontrol
visual-studio-code
vlc
xquartz
