# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle' # To be able to use run `brew bundle` to install all apps - https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53

# Binaries
brew 'bash' # Latest Bash version
#brew 'bat' # Improved cat command
#brew 'gh' # GitHub CLI
#brew 'jq' # JSON parser
brew 'git'
brew 'wget' # Download files from the web
brew 'mackup' # Backup and restore app settings on macOS
brew 'mas' # Mac App Store manager
brew 'tree' # Display directories as trees 
brew 'ncdu' # Disk usage analyzer
#brew 'xz' # General-purpose data compression with high compression ratio
brew 'bash-completion'
brew 'brew-cask-completion'
brew 'htop'
brew 'neofetch'
brew 'curl'
brew 'tmux'
brew 'nmap'
brew 'p7zip'
#brew 'rclone'docker-compose'
brew 'micro'






# Development
brew 'imagemagick' # Image processing library
brew 'openssl'
#brew 'direnv' # Load/unload environment variables based on current directory
#brew 'pyenv' # Python version manager
cask 'adoptopenjdk' # Java JDK

# Apps
# Download Tinker tool to speed up animations and more - https://www.bresink.com/osx/TinkerTool.html
cask 'visual-studio-code'
#cask 'github'
#cask 'whatsapp'
#cask 'android-studio'
#cask 'google-chrome'
cask 'adobe-acrobat-reader'	
cask 'darktable'		
cask 'macfuse'			
cask 'smcfancontrol'
cask 'alacritty'
cask 'meld'
cask 'hammerspoon'
cask 'vlc'			
cask 'iterm2'
cask 'xquartz'
cask 'audacity'		
cask 'keepassxc'		
cask 'rancher'
#cask 'cyberduck'		
#cask 'librecad'		
cask 'rectangle'



# Mac App Store
mas 'Xcode', id: 497799835
